---
type: SketchBase
namespace: Autodesk.Revit.DB
version: 2024
members: 1
tags: [revit-api, class]
---

# SketchBase

`Autodesk.Revit.DB.SketchBase` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | Parameter | — | `` |